Series

In [2]:
import pandas as pd

시리즈 :컬럼 + 인덱스 형식으로 저장, 관리, 리스트/배열과 유사한 형태
*컬럼 : 1차원 데이터 - 1개
*컬럼들 > 데이터프레임

데이터프레임 : 컬럼들 + 인덱스, 엑셀 표(테이블) 유사한 형태

In [3]:
pd.Series([10,20,30])   #__init__(self, 리스트객체) 이렇게 된 것임
#(,,)이거는 생성자 부르는 애자나 - 세개를 받는줄 알고 해석하러 간 것임..
#해석해봤더니 이렇게 볼 수가 없어...  #탭이랑 쉬프트탭했는데 .뒤에 뭐나왔는지 안나왔어
#이렇게 하는 순간 하나만 입력한 것이 됨.

0    10
1    20
2    30
dtype: int64

In [4]:
s1 = pd.Series([10,20,30])   
#__init__(self, 리스트객체) 이렇게 된 것임
#tab키 눌러도 안보여!! 쉬프트탭도 안보여
s1[0:2]  #인덱싱, 슬라이싱도 됨...

0    10
1    20
dtype: int64

In [5]:
col_idx = ['A','B','C']
data = [10, 20, 30]
s2 = pd.Series(data, index=col_idx)
s2 #dtype = 판다스의 데이터타입임 - 파이썬의 데이터 타입이 아니라...

A    10
B    20
C    30
dtype: int64

In [ ]:
s2['A': 'C']  #이게 되면 딕셔너리도 되겠지

s2[0] #[]>> 인덱싱 표식 리스트인지 헷갈려서 새로운 방식 도입함

C:\Users\Admin\AppData\Local\Temp\ipykernel_5616\1383103186.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[0] #[]>> 인덱싱 표식 리스트인지 헷갈려서 새로운 방식 도입함

np.int64(10)

In [ ]:
s2[0:3] # 순서, 위치기반 > -1까지 나옴
s2['A': 'C'] #슬라이싱, 이름 기반 인덱스 추출 - 다 나옴

In [18]:
dict_data = {'A': 10, 'B':20, 'C':30}   #json같은애들이 이렇게 생겨서 이걸 받아서 바꿀 때 쓰는 것 - 이름 지어주면 슬라이싱이나 인덱싱할 때도 직관적이라서 편함
type(dict_data)
s3 = pd.Series(dict_data)

In [19]:
s3

A    10
B    20
C    30
dtype: int64

In [20]:
s3.info() #객체의 메소드 이 시리즈를 통해서 info를 도출했더니 - 판다스가 제공해주는 인포메이션 메소드 - 데이터프레임도 사용 가능 - 별 정보 다 줌 - s3만 봐서는 뭔지 모르니까

<class 'pandas.core.series.Series'>
Index: 3 entries, A to C
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      int64
dtypes: int64(1)
memory usage: 156.0+ bytes

In [9]:
#판다스에서 인덱싱 쉽게 정의하는 법

In [10]:
#노션에 시리즈 파퓰레이션.. 실제로 꺼내보기

In [11]:
#시리즈의 속성
    #리스트로 시리즈 생성
data = [1,2,3,4,5]
s1 = pd.Series(data)
print(s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
#인덱스 지정하여 시리즈 생성
data = [1,2,3,4,5]
index = ['a', 'b', 'c', 'd', 'e']
s2 = pd.Series(data, index=index)  #인덱스는 선택사항!!
print(s2)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [13]:
#딕셔너리로 시리즈 생성 - 키가 인덱스가 됨
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
print(s3)

a    1
b    2
c    3
d    4
dtype: int64

In [25]:
#시리즈의 인덱스
population = pd.Series([9776.0, 2729, 1566, 3158], index=['서울', '부산', '인천', '대구'])
population # 습관적으로 확인해보기
# 넘파이에서 이렇게 하나만 .0 넣어도 쭉 바꿔줌 - 넘파이에서 와서 가능

서울    9776.0
부산    2729.0
인천    1566.0
대구    3158.0
dtype: float64

In [ ]:
print(population['서울']) #9776 출력
print(population[['서울', '부산']]) #여기서 왜 [[]]이렇게 두 번 들어가는지? - 콤마는 행과 열을 지정해서  - 여러개야 라는 의미에서 리스트 안에 리스트가 또 있음.. 인덱스 지정 할 때 여러개 하고싶다 => 리스트 지정해서 만들어줘라 이게 원칙임 #서울과 부산의 데이터만 선택
#asarray는 무엇인지
print(population[['서울', '인천']])

9776.0
서울    9776.0
부산    2729.0
dtype: float64
서울    9776.0
인천    1566.0
dtype: float64

In [ ]:
population['제주']=20  #행추가

In [29]:
population

서울    9776.0
부산    2729.0
인천    1566.0
대구    3158.0
제주      20.0
dtype: float64

In [30]:
population['부산']=3500

In [31]:
population

서울    9776.0
부산    3500.0
인천    1566.0
대구    3158.0
제주      20.0
dtype: float64

In [15]:
s3.info() #객체의 메소드 이 시리즈를 통해서 info를 도출했더니 - 판다스가 제공해주는 인포메이션 메소드 - 데이터프레임도 사용 가능 - 별 정보 다 줌 - s3만 봐서는 뭔지 모르니까

<class 'pandas.core.series.Series'>
Index: 4 entries, a to d
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

# 데이터 프레임 DataFrame

In [33]:
#리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]
data  #변수받으면 항상 찍어보기

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [35]:
pd.DataFrame(data, columns=['A', 'B', 'C'], index=['홍진경', '김숙', '주우재'])

     A  B  C
홍진경  1  2  3
김숙   4  5  6
주우재  7  8  9

In [37]:
import numpy as np
import pandas as pd

# 2차원 넘파이 어레이 생성
arr = np.array([[1, 2, 3],
                [4, 5, 6],
                [7, 8, 9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [38]:
pd.DataFrame(arr, columns=['A', 'B', 'C'], index=['홍진경', '김숙', '주우재'])

     A  B  C
홍진경  1  2  3
김숙   4  5  6
주우재  7  8  9

In [ ]:
#출신은 달라도 데이터프레임에 들어오면 같아진다

In [40]:
# 시리즈 생성
names = pd.Series(['김철수', '이영희', '박민수'])
ages = pd.Series([25, 28, 22])
scores = pd.Series([85, 92, 78])

names, ages, scores

(0    김철수
 1    이영희
 2    박민수
 dtype: object,
 0    25
 1    28
 2    22
 dtype: int64,
 0    85
 1    92
 2    78
 dtype: int64)

In [42]:
#pd.DataFrame([names, ages, scores])
#names가 하나의 컬럼이라는 걸 알려줘야 함 - 딕셔너리 생성

pd.DataFrame({
    'name':names,
    'age':ages,
    'score': scores
})

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78

In [43]:
data = {
    '이름': ['김철수', '이영희', '박민수'],
    '나이': [25, 28, 22],
    '점수': [85, 92, 78]
}

data

{'이름': ['김철수', '이영희', '박민수'], '나이': [25, 28, 22], '점수': [85, 92, 78]}

In [45]:
df = pd.DataFrame(data)
print(df)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [55]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희','박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [56]:
#인덱스 여기서 만들기
df.index= ['A','B','C','D','E','F','G']
print(df.index)

# columns 속성으로 모든 열 이름 한번에 변경
df.columns = ['name', 'age', 'score']

print(df.columns)

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')
Index(['name', 'age', 'score'], dtype='object')

In [ ]:
# 하나만 바꾸기
#df.rename(columns={'name':'이름'}, inplace=) #before:after

inplace 비추! >>
 새로운 df 복사본에서 확인하는 방법이 안전함

In [57]:
df1 = df.rename(columns={'name':'이름'})
df1

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [ ]:
#미리보기 - 함수 3가지
df.info()
df.head() #default 5개 > 많으면 3개
df.tail()   #head는 위에서부터, tail밑에서부터 보여줌

In [ ]:
df.info() #dtype - object는 문자열이라는 의미

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, A to G
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int64
 2   score   7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 524.0+ bytes

In [59]:
df.head(3)

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78

In [60]:
df.tail(5)

  name  age  score
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [62]:
df.describe()  #기술통계

             age      score
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

# 인덱싱
[] 인덱싱

- iloc[]행기반 인덱싱 >>> [행, 열]
- loc[] 이름기반(위치) 인덱싱 >> [행이름, 열이름]

- :의 의미 >> start:end 까지 슬라이싱
- loc[행이름:행이름]
- iloc[행번호:행번호] >> end 행번호는  -1까지

In [63]:
df1

    이름  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

In [78]:
#df1[['이름', 'age']]  #여러개 할 때는 리스트로 만들어서!!!

df1.loc[  : , ['이름', 'age']] #행과 열을 지정해줘야함

    이름  age
A  김철수   25
B  이영희   28
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24
G  윤지원   29

In [68]:
df1.loc['A'] #행, 열

이름       김철수
age       25
score     85
Name: A, dtype: object

In [71]:
df1.iloc[0:3, 0:2] #행번호, 열, :은 start:end(-1)

    이름  age
A  김철수   25
B  이영희   28
C  박민수   22

In [84]:
# # 연습문제
# [기본]

# 모든 행에서 이름 열만 선택하세요.
df1
df1.loc[ : ,'이름']

# 모든 행에서 이름과 score 열을 선택하세요.
df1.loc[ : , ['이름', 'score']]

# 인덱스 C 행의 모든 데이터를 선택하세요.
df1.loc['C']


# 인덱스 D 행의 age 값만 선택하세요.
df1.iloc[3:4, 1:2]

   age
D   31

In [87]:
# [슬라이싱]


# 인덱스 B부터 E까지의 모든 행을 선택하세요.
df1.loc['B': 'E']

# 인덱스 C부터 F까지의 이름과 age 열만 선택하세요.
df1.loc['C':'F', '이름':'age']

# 인덱스 A부터 G까지에서 score 열만 선택하세요.
df1.loc['A':'G', 'score']

A    85
B    92
C    78
D    95
E    88
F    73
G    91
Name: score, dtype: int64

# boolean 인덱싱

In [98]:
df[df['score'] > 90]  #시리즈의 모든 요소에 적용 - #vectorization - boolean list의 요소값 True, False로 해놓고 그 결과를 나타낸 것

  name  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [ ]:
#[조건 + loc]
#age가 27 이상인 행만 선택하세요.
df1.loc[df1['age']>=27]
cond = df1['age']>= 27
df1.loc[cond]

#score가 90 이상인 사람의 이름과 score만 출력하세요.
#df1.loc[df1['score']>=90] - 아 age가 나오는구나
#df1.loc[행, 열]

df1.loc[df1['score']>=90 , ['이름', 'score']]

#age가 25 이상이면서 score가 90 이상인 행을 모두 선택하세요.
#df1.loc[df1.['age']>=25 and df1.['score']>=90]

cond1 = df1['age'] >=25
cond2 = df1['score']>=90
df1.loc[cond1 & cond2]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [ ]:
# [기본]

# 첫 번째 행의 모든 데이터를 선택하세요.

# 세 번째 행의 이름 값만 선택하세요.

# 처음 3개의 행을 선택하세요.

# 마지막 행의 score 값만 선택하세요.
df1.iloc[-1,2]

In [ ]:
# [슬라이싱]

# 1번 행부터 4번 행까지 선택하세요.
df1.iloc[1:5]

# 2번 행부터 5번 행까지에서 이름과 age 열만 선택하세요.
df1.iloc[2:6, 0:2]

# 모든 행에서 age 열만 선택하세요.
df1.iloc[ : , 1] # 콤마 앞은 생략하면 안됨 - 처음부터 끝까지는 콜론으로 표기

    이름  age
B  이영희   28
C  박민수   22
D  정수진   31
E  최영호   27
F  한미래   24

In [ ]:
# [조합 문제]

# score 열만 선택하되, 앞에서 4개의 행만 출력하세요.
    # df1.iloc[:4, 'score'] -> 이러면 에러남 - score라는 이름 모른다면서..
df1.iloc[:4, 2]

# 이름과 score 열을 선택하되, 마지막 3개의 행만 출력하세요.
df1.iloc[-3:, ::2 ]     #-3: 인 이유? :-3이아니라? ::2는 뭐였지?

    #이렇게도 가능
df1.tail(3).loc[:,['이름', 'score']] 
df1.iloc[-3: , [0,2]]

# 짝수 번째 행(0, 2, 4, 6)의 모든 데이터를 선택하세요.
df1.iloc[[0,2,4,6]] #아 그냥 선택하면 되는구나

In [94]:
df1.loc[df1['score']>=90]

    이름  age  score
B  이영희   28     92
D  정수진   31     95
G  윤지원   29     91

In [104]:
df1.loc[df1.['age']>=25 & df1.['score']>=90]

SyntaxError: invalid syntax (3630021113.py, line 1)